# Generic Zone Remove Spaces Method

Source: https://www.revitapidocs.com/2026/5de0c033-c195-2926-4870-ea566c8e41ae.htm

---

| Generic Zone Remove Spaces Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void RemoveSpaces(
	ISet<ElementId> spaceIds
)
```

```
Public Sub RemoveSpaces (
	spaceIds As ISet(Of ElementId)
)
```

```
public:
void RemoveSpaces(
	ISet<ElementId^>^ spaceIds
)
```

```
member RemoveSpaces :
        spaceIds : ISet<ElementId> -> unit
```

#### Parameters

spaceIds ISet ElementId

See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace